УТ_для_edt.РасширениеСмарт/src/Documents/МаркетинговыеМероприятияДокумент/МаркетинговыеМероприятияДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>МаркетинговыеМероприятияДокумент</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НаименованиеМероприятия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПользовательПоставилОценку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДемоЗал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипМероприятия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяНачалаПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КлиентПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяПроведенияОт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИсполнительДемоЗал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяПроведенияДо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗаявкаЗакрыта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаФакт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed5953c0-f430-489a-959a-1c9b18a43b94">
    <name>КомуПередано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7fa85e95-3db1-4305-a9b3-eff06a2fa2c7">
    <name>КомментарийИнженера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec30e53b-638b-4a49-83b6-d35b7b34d6ab">
    <name>ЖелаемаяДатаИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="042868a1-e1b7-4bf7-a543-11f52a366a04">
    <name>Срочно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e082edc2-87c6-4a03-bd26-abd073e52e25">
    <name>ДатаНачалаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a0c18547-e9eb-4899-916a-5b2e886b3611">
    <name>смартДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="591d17b1-6b51-434c-b04d-0093a434b66e">
    <name>смартДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79791d53-7f2d-47a5-b15e-2d4440382239">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7d5fd00-7cc7-458b-aa54-a3662fea2df1">
    <name>смартПровелДемонстрацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>табПредставительКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КонтактныеЛица</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="03d6da93-802e-4435-8914-be9c96eccc09">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>табМатериалыДляДемонстрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Материалы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>табОборудованиеДляДемонстрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Оборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="17912b24-a32a-4739-8f43-0640817b2712">
    <name>ИсполнителиДемоЗал</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6383e9aa-3573-4cd3-a1b9-c6aaa13839b5">
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b6f03615-5dad-4109-bba8-95ff63f8ee9b">
      <name>ЗатраченноеВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7c4a180a-c7ab-41c7-87d5-e56c178c4e3b">
      <name>СверхурочноеВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="99ada54f-5520-400b-baea-b5e9eec6aade">
      <name>смартКомментарийИнженера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="ef823346-0d77-4fa8-aec6-a4089b82b441">
    <name>ВидыРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="860bd59b-2a0d-4e31-9ff1-f76c19d90e5c">
      <name>ВидРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4e93c4d2-6461-4800-9185-1ccaf477b170">
      <name>смартЗатраченноеВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a78bebfb-6d7b-435e-b9cf-a6a1ae596721">
      <name>смартСверхурочноеВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c3acc578-0cd3-4ba3-8977-29f9d585aea7">
      <name>смартИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e1f58398-3b23-4795-98fb-e0ab4701d5d2">
    <name>ОборудованиеДляДемонстрацииИнженер</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="59dcf85e-556e-4954-8b8b-f88d427f2fd2">
      <name>Оборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8b412641-a641-49cb-80be-6643fba5619b">
      <name>смартИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеОтгружатьЧастями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Documents/МаркетинговыеМероприятияДокумент/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ДоработкиСмарт
#Область Печать

Функция  Печать(ТабДок, ПараметрКоманды) Экспорт	
	
	Макет = Документы.МаркетинговыеМероприятияДокумент.ПолучитьМакет("МакетЗаявкаНаДемонстрацию");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МаркетинговыеМероприятияДокумент.ВремяНачалаПлан,
	|	МаркетинговыеМероприятияДокумент.ВремяПроведенияДо,
	|	МаркетинговыеМероприятияДокумент.ВремяПроведенияОт,
	|	МаркетинговыеМероприятияДокумент.Дата,
	|	МаркетинговыеМероприятияДокумент.ДатаЗакрытияЗаявки,
	|	МаркетинговыеМероприятияДокумент.ДатаНачалаПлан,
	|	МаркетинговыеМероприятияДокумент.ДатаНачалаФакт,
	|	МаркетинговыеМероприятияДокумент.ДатаОценки,
	|	МаркетинговыеМероприятияДокумент.ЗаявкаЗакрыта,
	|	МаркетинговыеМероприятияДокумент.ИсполнительДемоЗал,
	|	МаркетинговыеМероприятияДокумент.КлиентПартнер,
	|	МаркетинговыеМероприятияДокумент.Комментарий,
	|	МаркетинговыеМероприятияДокумент.Менеджер,
	|	МаркетинговыеМероприятияДокумент.НаименованиеМероприятия,
	|	МаркетинговыеМероприятияДокумент.Номер,
	|	МаркетинговыеМероприятияДокумент.ОтсроченнаяЗаявка,
	|	МаркетинговыеМероприятияДокумент.Оценка,
	|	МаркетинговыеМероприятияДокумент.ПользовательПоставилОценку,
	|	МаркетинговыеМероприятияДокумент.ТипМероприятия,
	//++ смарт:ММ #026 181 01.03.2020 
	|	МаркетинговыеМероприятияДокумент.КомуПередано,
	|	МаркетинговыеМероприятияДокумент.ИсполнителиДемоЗал.(
	|		НомерСтроки,
	|		Исполнитель,
	|		ЗатраченноеВремя,
	|		СверхурочноеВремя,
	|		смартКомментарийИнженера
	|	),
	|	МаркетинговыеМероприятияДокумент.ВидыРабот.(
	|		НомерСтроки,
	|		ВидРаботы,
	|		смартЗатраченноеВремя,
	|		смартСверхурочноеВремя,
	|		смартИсполнитель
	|	),
	|	МаркетинговыеМероприятияДокумент.ОборудованиеДляДемонстрацииИнженер.(
	|		НомерСтроки,
	|		Оборудование,
	|		смартИсполнитель
	|	),
	//-- смарт:ММ 01.03.2020
	|	МаркетинговыеМероприятияДокумент.табОборудованиеДляДемонстрации.(
	|		НомерСтроки,
	|		Оборудование
	|	),
	|	МаркетинговыеМероприятияДокумент.табМатериалыДляДемонстрации.(
	|		НомерСтроки,
	|		Материалы
	|	),
	|	МаркетинговыеМероприятияДокумент.табПредставительКлиента.(
	|		НомерСтроки,
	|		КонтактныеЛица
	|	),
	|	МаркетинговыеМероприятияДокумент.ИсторияИзмененияОценки.(
	|		НомерСтроки,
	|		Пользователь,
	|		Оценка,
	|		ДатаИзменения
	|	)
	|ИЗ
	|	Документ.МаркетинговыеМероприятияДокумент КАК МаркетинговыеМероприятияДокумент
	|ГДЕ
	|	МаркетинговыеМероприятияДокумент.Ссылка В(&МассивОбъектов)";
	Запрос.Параметры.Вставить("МассивОбъектов", ПараметрКоманды);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьтабОборудованиеДляДемонстрацииШапка = Макет.ПолучитьОбласть("табОборудованиеДляДемонстрацииШапка");
	ОбластьтабОборудованиеДляДемонстрации = Макет.ПолучитьОбласть("табОборудованиеДляДемонстрации");
	ОбластьтабМатериалыДляДемонстрацииШапка = Макет.ПолучитьОбласть("табМатериалыДляДемонстрацииШапка");
	ОбластьтабМатериалыДляДемонстрации = Макет.ПолучитьОбласть("табМатериалыДляДемонстрации");
	ОбластьтабПредставительКлиентаШапка = Макет.ПолучитьОбласть("табПредставительКлиентаШапка");
	ОбластьтабПредставительКлиента = Макет.ПолучитьОбласть("табПредставительКлиента");
	//ОбластьИсторияИзмененияОценкиШапка = Макет.ПолучитьОбласть("ИсторияИзмененияОценкиШапка");
	//ОбластьИсторияИзмененияОценки = Макет.ПолучитьОбласть("ИсторияИзмененияОценки");
	//Смарт {{ 677 Корнющенко 18.10.21
	ОбластьтабОборудованиеДляДемонстрацииИнженерШапка = Макет.ПолучитьОбласть("ОборудованиеДляДемонстрацииИнженерШапка");
	ОбластьтабОборудованиеДляДемонстрацииИнженер = Макет.ПолучитьОбласть("ОборудованиеДляДемонстрацииИнженер");
	ОбластьВидыРаботШапка = Макет.ПолучитьОбласть("ВидыРаботШапка");
	ОбластьВидыРабот = Макет.ПолучитьОбласть("ВидыРабот");

	//Смарт }} 677 Корнющенко 18.10.21
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок, Выборка.Уровень());

		Шапка.Параметры.Заполнить(Выборка);
		
		//++ смарт:ММ #026 181 01.03.2020 
		// Исполнители
		ИсполнителиТекстШапка = "";
		ИсполнителиТекст = "";
		КоличествоИсполнителей = 0;
		
		ВыборкаИсполнителиДемоЗал = Выборка.ИсполнителиДемоЗал.Выбрать();
		Пока ВыборкаИсполнителиДемоЗал.Следующий() Цикл
			КоличествоИсполнителей = КоличествоИсполнителей + 1;
			ИсполнителиТекстШапка = ИсполнителиТекстШапка + ?(ЗначениеЗаполнено(ИсполнителиТекстШапка), "; ", "") + ВыборкаИсполнителиДемоЗал.Исполнитель;
			
			СверхурочноеВремя = "";
			Если ЗначениеЗаполнено(ВыборкаИсполнителиДемоЗал.СверхурочноеВремя) Тогда
				СверхурочноеВремя = "сверхурочное время: " + ВыборкаИсполнителиДемоЗал.СверхурочноеВремя + " ч." + Символы.ПС + "Комментарий:" + ВыборкаИсполнителиДемоЗал.смартКомментарийИнженера;
			КонецЕсли;
			
			ТекстТекущийИсполнитель = "" + ВыборкаИсполнителиДемоЗал.Исполнитель + ". Затраченное время: " 
				+ ВыборкаИсполнителиДемоЗал.ЗатраченноеВремя + " ч." 
				+ ?(ЗначениеЗаполнено(СверхурочноеВремя), ", " + СверхурочноеВремя, "");
				
			ИсполнителиТекст = ИсполнителиТекст + ?(ЗначениеЗаполнено(ИсполнителиТекст), Символы.ПС, "") + ТекстТекущийИсполнитель;
			
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(ИсполнителиТекстШапка) И ЗначениеЗаполнено(Выборка.ИсполнительДемоЗал) Тогда
			КоличествоИсполнителей = 1;
			ИсполнителиТекстШапка = Выборка.ИсполнительДемоЗал;
		КонецЕсли;	
		Шапка.Параметры.ИсполнительДемоЗал = ИсполнителиТекстШапка;
		//-- смарт:ММ 01.03.2020
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		//Таблица Представитель клиента
		ТабДок.Вывести(ОбластьтабПредставительКлиентаШапка);
		ВыборкатабПредставительКлиента = Выборка.табПредставительКлиента.Выбрать();
		Пока ВыборкатабПредставительКлиента.Следующий() Цикл
			ОбластьтабПредставительКлиента.Параметры.Заполнить(ВыборкатабПредставительКлиента);
			ТабДок.Вывести(ОбластьтабПредставительКлиента, ВыборкатабПредставительКлиента.Уровень());
		КонецЦикла;
		
		//Таблица Оборудование
		ТабДок.Вывести(ОбластьтабОборудованиеДляДемонстрацииШапка);
		ВыборкатабОборудованиеДляДемонстрации = Выборка.табОборудованиеДляДемонстрации.Выбрать();
		Пока ВыборкатабОборудованиеДляДемонстрации.Следующий() Цикл
			ОбластьтабОборудованиеДляДемонстрации.Параметры.Заполнить(ВыборкатабОборудованиеДляДемонстрации);
			ТабДок.Вывести(ОбластьтабОборудованиеДляДемонстрации, ВыборкатабОборудованиеДляДемонстрации.Уровень());
		КонецЦикла;
		
		//Смарт {{ 677 Корнющенко 18.10.21
		//Таблица Оборудование Инженер
		ТабДок.Вывести(ОбластьтабОборудованиеДляДемонстрацииИнженерШапка);
		ВыборкаОборудованиеДляДемонстрацииИнженер = Выборка.ОборудованиеДляДемонстрацииИнженер.Выбрать();
		Пока ВыборкаОборудованиеДляДемонстрацииИнженер.Следующий() Цикл
			ОбластьтабОборудованиеДляДемонстрацииИнженер.Параметры.Заполнить(ВыборкаОборудованиеДляДемонстрацииИнженер);
			ТабДок.Вывести(ОбластьтабОборудованиеДляДемонстрацииИнженер, ВыборкаОборудованиеДляДемонстрацииИнженер.Уровень());
		КонецЦикла;
		
		//Таблица Виды работ Инженеров
		ТабДок.Вывести(ОбластьВидыРаботШапка);
		ВыборкаВидыРабот = Выборка.ВидыРабот.Выбрать();
		Пока ВыборкаВидыРабот.Следующий() Цикл
			ОбластьВидыРабот.Параметры.Заполнить(ВыборкаВидыРабот);
			ТабДок.Вывести(ОбластьВидыРабот, ВыборкаВидыРабот.Уровень());
		КонецЦикла;

		//Смарт }} 677 Корнющенко 18.10.21


		//Таблица Материалы
		ТабДок.Вывести(ОбластьтабМатериалыДляДемонстрацииШапка);
		ВыборкатабМатериалыДляДемонстрации = Выборка.табМатериалыДляДемонстрации.Выбрать();
		Пока ВыборкатабМатериалыДляДемонстрации.Следующий() Цикл
			ОбластьтабМатериалыДляДемонстрации.Параметры.Заполнить(ВыборкатабМатериалыДляДемонстрации);
			ТабДок.Вывести(ОбластьтабМатериалыДляДемонстрации, ВыборкатабМатериалыДляДемонстрации.Уровень());
		КонецЦикла;
		
		//ТабДок.Вывести(ОбластьИсторияИзмененияОценкиШапка);
		//ВыборкаИсторияИзмененияОценки = Выборка.ИсторияИзмененияОценки.Выбрать();
		//Пока ВыборкаИсторияИзмененияОценки.Следующий() Цикл
		//	ОбластьИсторияИзмененияОценки.Параметры.Заполнить(ВыборкаИсторияИзмененияОценки);
		//	ТабДок.Вывести(ОбластьИсторияИзмененияОценки, ВыборкаИсторияИзмененияОценки.Уровень());
		//КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		
		//++ смарт:ММ #026 181 01.03.2020 
		// Заполнение комментария инженера

		// Кому передано
		КомментарийИнженера = "";
		Если ЗначениеЗаполнено(Выборка.КомуПередано) Тогда
			КомментарийИнженера = КомментарийИнженера + "Кому передано: " + Выборка.КомуПередано;
		КонецЕсли;
				
		// Виды работ
		//ВидыРаботТекст = "";
		//
		//ВыборкаВидыРабот = Выборка.ВидыРабот.Выбрать();
		//Пока ВыборкаВидыРабот.Следующий() Цикл
		//	ВидыРаботТекст = ВидыРаботТекст + ?(ЗначениеЗаполнено(ВидыРаботТекст), "; ", "") + ВыборкаВидыРабот.ВидРаботы;
		//КонецЦикла;
		//
		//Если ЗначениеЗаполнено(ВидыРаботТекст) Тогда
		//	Если ЗначениеЗаполнено(КомментарийИнженера) Тогда
		//		КомментарийИнженера = КомментарийИнженера + Символы.ПС;
		//	КонецЕсли;
		//	КомментарийИнженера = КомментарийИнженера + "Виды работ: " + ВидыРаботТекст;
		//КонецЕсли;
		//
		//// Оборудование инженер
		//ОборудованиеИнженерТекст = "";
		//
		//ВыборкаОборудованиеДляДемонстрацииИнженер = Выборка.ОборудованиеДляДемонстрацииИнженер.Выбрать();
		//Пока ВыборкаОборудованиеДляДемонстрацииИнженер.Следующий() Цикл
		//	ОборудованиеИнженерТекст = ОборудованиеИнженерТекст 
		//			+ ?(ЗначениеЗаполнено(ОборудованиеИнженерТекст), "; ", "") 
		//			+ ВыборкаОборудованиеДляДемонстрацииИнженер.Оборудование;
		//КонецЦикла;
		//
		//Если ЗначениеЗаполнено(ОборудованиеИнженерТекст) Тогда
		//	Если ЗначениеЗаполнено(КомментарийИнженера) Тогда
		//		КомментарийИнженера = КомментарийИнженера + Символы.ПС;
		//	КонецЕсли;
		//	КомментарийИнженера = КомментарийИнженера + "Оборудование: " + ОборудованиеИнженерТекст;
		//КонецЕсли;
		
		// Исполнители		
		Если ЗначениеЗаполнено(ИсполнителиТекст) Тогда
			Если ЗначениеЗаполнено(КомментарийИнженера) Тогда
				КомментарийИнженера = КомментарийИнженера + Символы.ПС;
			КонецЕсли;
			КомментарийИнженера = КомментарийИнженера + ?(КоличествоИсполнителей = 1, "Исполнитель: ", "Исполнители:" + Символы.ПС) + ИсполнителиТекст;
		КонецЕсли;
		
		
		Подвал.Параметры.КомментарийИнженера = КомментарийИнженера;	
		//-- смарт:ММ 01.03.2020
		
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецФункции

//Функция ПолучитьДанныеДляПечати(Объект)
//	
//	СтруктураДанныхДляПечати = Новый Структура;
//	
//	Возврат СтруктураДанныхДляПечати;
//	
//КонецФункции

//Тест печать через общую форму
Функция ПечатьЧерезОбщуюФорму(ТабДок, ОбъектСсылка) Экспорт
	
    Макет = Документы.МаркетинговыеМероприятияДокумент.ПолучитьМакет("МакетЗаявкаНаДемонстрацию");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МаркетинговыеМероприятияДокумент.ВремяНачалаПлан,
	|	МаркетинговыеМероприятияДокумент.ВремяПроведенияДо,
	|	МаркетинговыеМероприятияДокумент.ВремяПроведенияОт,
	|	МаркетинговыеМероприятияДокумент.Дата,
	|	МаркетинговыеМероприятияДокумент.ДатаЗакрытияЗаявки,
	|	МаркетинговыеМероприятияДокумент.ДатаНачалаПлан,
	|	МаркетинговыеМероприятияДокумент.ДатаНачалаФакт,
	|	МаркетинговыеМероприятияДокумент.ДатаОценки,
	|	МаркетинговыеМероприятияДокумент.ЗаявкаЗакрыта,
	|	МаркетинговыеМероприятияДокумент.ИсполнительДемоЗал,
	|	МаркетинговыеМероприятияДокумент.КлиентПартнер,
	|	МаркетинговыеМероприятияДокумент.Комментарий,
	|	МаркетинговыеМероприятияДокумент.Менеджер,
	|	МаркетинговыеМероприятияДокумент.НаименованиеМероприятия,
	|	МаркетинговыеМероприятияДокумент.Номер,
	|	МаркетинговыеМероприятияДокумент.ОтсроченнаяЗаявка,
	|	МаркетинговыеМероприятияДокумент.Оценка,
	|	МаркетинговыеМероприятияДокумент.ПользовательПоставилОценку,
	|	МаркетинговыеМероприятияДокумент.ТипМероприятия,
	//++ смарт:ММ #026 181 01.03.2020 
	|	МаркетинговыеМероприятияДокумент.КомуПередано,
	|	МаркетинговыеМероприятияДокумент.ИсполнителиДемоЗал.(
	|		НомерСтроки,
	|		Исполнитель,
	|		ЗатраченноеВремя,
	|		СверхурочноеВремя,
	|		смартКомментарийИнженера
	|	),
	|	МаркетинговыеМероприятияДокумент.ВидыРабот.(
	|		НомерСтроки,
	|		ВидРаботы,
	|		смартЗатраченноеВремя,
	|		смартСверхурочноеВремя,
	|		смартИсполнитель
	|	),
	|	МаркетинговыеМероприятияДокумент.ОборудованиеДляДемонстрацииИнженер.(
	|		НомерСтроки,
	|		Оборудование,
	|		смартИсполнитель
	|	),
	//-- смарт:ММ 01.03.2020
	|	МаркетинговыеМероприятияДокумент.табОборудованиеДляДемонстрации.(
	|		НомерСтроки,
	|		Оборудование
	|	),
	|	МаркетинговыеМероприятияДокумент.табМатериалыДляДемонстрации.(
	|		НомерСтроки,
	|		Материалы
	|	),
	|	МаркетинговыеМероприятияДокумент.табПредставительКлиента.(
	|		НомерСтроки,
	|		КонтактныеЛица
	|	),
	|	МаркетинговыеМероприятияДокумент.ИсторияИзмененияОценки.(
	|		НомерСтроки,
	|		Пользователь,
	|		Оценка,
	|		ДатаИзменения
	|	),
	|	МаркетинговыеМероприятияДокумент.ДемоЗал
	|ИЗ
	|	Документ.МаркетинговыеМероприятияДокумент КАК МаркетинговыеМероприятияДокумент
	|ГДЕ
	|	МаркетинговыеМероприятияДокумент.Ссылка В(&ОбъектСсылка)";
	Запрос.Параметры.Вставить("ОбъектСсылка", ОбъектСсылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьтабОборудованиеДляДемонстрацииШапка = Макет.ПолучитьОбласть("табОборудованиеДляДемонстрацииШапка");
	ОбластьтабОборудованиеДляДемонстрации = Макет.ПолучитьОбласть("табОборудованиеДляДемонстрации");
	ОбластьтабМатериалыДляДемонстрацииШапка = Макет.ПолучитьОбласть("табМатериалыДляДемонстрацииШапка");
	ОбластьтабМатериалыДляДемонстрации = Макет.ПолучитьОбласть("табМатериалыДляДемонстрации");
	ОбластьтабПредставительКлиентаШапка = Макет.ПолучитьОбласть("табПредставительКлиентаШапка");
	ОбластьтабПредставительКлиента = Макет.ПолучитьОбласть("табПредставительКлиента");
	//ОбластьИсторияИзмененияОценкиШапка = Макет.ПолучитьОбласть("ИсторияИзмененияОценкиШапка");
	//ОбластьИсторияИзмененияОценки = Макет.ПолучитьОбласть("ИсторияИзмененияОценки");
	//Смарт {{ 677 Корнющенко 18.10.21
	ОбластьтабОборудованиеДляДемонстрацииИнженерШапка = Макет.ПолучитьОбласть("ОборудованиеДляДемонстрацииИнженерШапка");
	ОбластьтабОборудованиеДляДемонстрацииИнженер = Макет.ПолучитьОбласть("ОборудованиеДляДемонстрацииИнженер");
	ОбластьВидыРаботШапка = Макет.ПолучитьОбласть("ВидыРаботШапка");
	ОбластьВидыРабот = Макет.ПолучитьОбласть("ВидыРабот");
	//Смарт }} 677 Корнющенко 18.10.21
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок, Выборка.Уровень());

		Шапка.Параметры.Заполнить(Выборка);
		
		//++ смарт:ММ #026 181 01.03.2020 
		// Исполнители
		ИсполнителиТекстШапка = "";
		ИсполнителиТекст = "";
		КоличествоИсполнителей = 0;
		
		ВыборкаИсполнителиДемоЗал = Выборка.ИсполнителиДемоЗал.Выбрать();
		Пока ВыборкаИсполнителиДемоЗал.Следующий() Цикл
			КоличествоИсполнителей = КоличествоИсполнителей + 1;
			ИсполнителиТекстШапка = ИсполнителиТекстШапка + ?(ЗначениеЗаполнено(ИсполнителиТекстШапка), "; ", "") + ВыборкаИсполнителиДемоЗал.Исполнитель;
			
			СверхурочноеВремя = "";
			Если ЗначениеЗаполнено(ВыборкаИсполнителиДемоЗал.СверхурочноеВремя) Тогда
			//++#1200 смарт: Лопато 03.10.2022 //Выводить комментарий инженера  
				//СверхурочноеВремя = "сверхурочное время: " + ВыборкаИсполнителиДемоЗал.СверхурочноеВремя + " ч." + Символы.ПС + "Комментарий:" + ВыборкаИсполнителиДемоЗал.смартКомментарийИнженера;
				СверхурочноеВремя = ?(ЗначениеЗаполнено(ИсполнителиТекст), Символы.ПС, "") + "сверхурочное время: " + ВыборкаИсполнителиДемоЗал.СверхурочноеВремя + " ч.";
			//--#1200 смарт: Лопато 03.10.2022
			КонецЕсли;
			
			ТекстТекущийИсполнитель = "" + ВыборкаИсполнителиДемоЗал.Исполнитель + ". Затраченное время: " 
				+ ВыборкаИсполнителиДемоЗал.ЗатраченноеВремя + " ч." 
				+ ?(ЗначениеЗаполнено(СверхурочноеВремя), ", " + СверхурочноеВремя, "");
				
			ИсполнителиТекст = ИсполнителиТекст + ?(ЗначениеЗаполнено(ИсполнителиТекст), Символы.ПС, "") + ТекстТекущийИсполнитель;

			//++#1200 смарт: Лопато 03.10.2022 //Выводить комментарий инженера  
			Если ЗначениеЗаполнено(ВыборкаИсполнителиДемоЗал.смартКомментарийИнженера) Тогда
				ИсполнителиТекст = ИсполнителиТекст + ?(ЗначениеЗаполнено(ИсполнителиТекст), Символы.ПС, "") + "Комментарий: " + ВыборкаИсполнителиДемоЗал.смартКомментарийИнженера;
			КонецЕсли;	
			//--#1200 смарт: Лопато 03.10.2022
			
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(ИсполнителиТекстШапка) И ЗначениеЗаполнено(Выборка.ИсполнительДемоЗал) Тогда
			КоличествоИсполнителей = 1;
			ИсполнителиТекстШапка = Выборка.ИсполнительДемоЗал;
		КонецЕсли;	
		Шапка.Параметры.ИсполнительДемоЗал = ИсполнителиТекстШапка;
		//-- смарт:ММ 01.03.2020
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		//Таблица Представитель клиента
		ТабДок.Вывести(ОбластьтабПредставительКлиентаШапка);
		ВыборкатабПредставительКлиента = Выборка.табПредставительКлиента.Выбрать();
		Пока ВыборкатабПредставительКлиента.Следующий() Цикл
			ОбластьтабПредставительКлиента.Параметры.Заполнить(ВыборкатабПредставительКлиента);
			ТабДок.Вывести(ОбластьтабПредставительКлиента, ВыборкатабПредставительКлиента.Уровень());
		КонецЦикла;
		
		//Таблица Оборудование
		ТабДок.Вывести(ОбластьтабОборудованиеДляДемонстрацииШапка);
		ВыборкатабОборудованиеДляДемонстрации = Выборка.табОборудованиеДляДемонстрации.Выбрать();
		Пока ВыборкатабОборудованиеДляДемонстрации.Следующий() Цикл
			ОбластьтабОборудованиеДляДемонстрации.Параметры.Заполнить(ВыборкатабОборудованиеДляДемонстрации);
			ТабДок.Вывести(ОбластьтабОборудованиеДляДемонстрации, ВыборкатабОборудованиеДляДемонстрации.Уровень());
		КонецЦикла;
		
		//Смарт {{ 677 Корнющенко 18.10.21
		//Таблица Оборудование Инженер
		ТабДок.Вывести(ОбластьтабОборудованиеДляДемонстрацииИнженерШапка);
		ВыборкаОборудованиеДляДемонстрацииИнженер = Выборка.ОборудованиеДляДемонстрацииИнженер.Выбрать();
		Пока ВыборкаОборудованиеДляДемонстрацииИнженер.Следующий() Цикл
			ОбластьтабОборудованиеДляДемонстрацииИнженер.Параметры.Заполнить(ВыборкаОборудованиеДляДемонстрацииИнженер);
			ТабДок.Вывести(ОбластьтабОборудованиеДляДемонстрацииИнженер, ВыборкаОборудованиеДляДемонстрацииИнженер.Уровень());
		КонецЦикла;
		
		//Таблица Виды работ Инженеров
		ТабДок.Вывести(ОбластьВидыРаботШапка);
		ВыборкаВидыРабот = Выборка.ВидыРабот.Выбрать();
		Пока ВыборкаВидыРабот.Следующий() Цикл
			ОбластьВидыРабот.Параметры.Заполнить(ВыборкаВидыРабот);
			ТабДок.Вывести(ОбластьВидыРабот, ВыборкаВидыРабот.Уровень());
		КонецЦикла;
		//Смарт }} 677 Корнющенко 18.10.21

		//Таблица Материалы
		ТабДок.Вывести(ОбластьтабМатериалыДляДемонстрацииШапка);
		ВыборкатабМатериалыДляДемонстрации = Выборка.табМатериалыДляДемонстрации.Выбрать();
		Пока ВыборкатабМатериалыДляДемонстрации.Следующий() Цикл
			ОбластьтабМатериалыДляДемонстрации.Параметры.Заполнить(ВыборкатабМатериалыДляДемонстрации);
			ТабДок.Вывести(ОбластьтабМатериалыДляДемонстрации, ВыборкатабМатериалыДляДемонстрации.Уровень());
		КонецЦикла;
		
		//ТабДок.Вывести(ОбластьИсторияИзмененияОценкиШапка);
		//ВыборкаИсторияИзмененияОценки = Выборка.ИсторияИзмененияОценки.Выбрать();
		//Пока ВыборкаИсторияИзмененияОценки.Следующий() Цикл
		//	ОбластьИсторияИзмененияОценки.Параметры.Заполнить(ВыборкаИсторияИзмененияОценки);
		//	ТабДок.Вывести(ОбластьИсторияИзмененияОценки, ВыборкаИсторияИзмененияОценки.Уровень());
		//КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		
		//++ смарт:ММ #026 181 01.03.2020 
		// Заполнение комментария инженера

		// Кому передано
		КомментарийИнженера = "";
		Если ЗначениеЗаполнено(Выборка.КомуПередано) Тогда
			КомментарийИнженера = КомментарийИнженера + "Кому передано: " + Выборка.КомуПередано;
		КонецЕсли;
				
		// Виды работ
		//ВидыРаботТекст = "";
		//
		//ВыборкаВидыРабот = Выборка.ВидыРабот.Выбрать();
		//Пока ВыборкаВидыРабот.Следующий() Цикл
		//	ВидыРаботТекст = ВидыРаботТекст + ?(ЗначениеЗаполнено(ВидыРаботТекст), "; ", "") + ВыборкаВидыРабот.ВидРаботы;
		//КонецЦикла;
		//
		//Если ЗначениеЗаполнено(ВидыРаботТекст) Тогда
		//	Если ЗначениеЗаполнено(КомментарийИнженера) Тогда
		//		КомментарийИнженера = КомментарийИнженера + Символы.ПС;
		//	КонецЕсли;
		//	КомментарийИнженера = КомментарийИнженера + "Виды работ: " + ВидыРаботТекст;
		//КонецЕсли;
		//
		//// Оборудование инженер
		//ОборудованиеИнженерТекст = "";
		//
		//ВыборкаОборудованиеДляДемонстрацииИнженер = Выборка.ОборудованиеДляДемонстрацииИнженер.Выбрать();
		//Пока ВыборкаОборудованиеДляДемонстрацииИнженер.Следующий() Цикл
		//	ОборудованиеИнженерТекст = ОборудованиеИнженерТекст 
		//			+ ?(ЗначениеЗаполнено(ОборудованиеИнженерТекст), "; ", "") 
		//			+ ВыборкаОборудованиеДляДемонстрацииИнженер.Оборудование;
		//КонецЦикла;
		//
		//Если ЗначениеЗаполнено(ОборудованиеИнженерТекст) Тогда
		//	Если ЗначениеЗаполнено(КомментарийИнженера) Тогда
		//		КомментарийИнженера = КомментарийИнженера + Символы.ПС;
		//	КонецЕсли;
		//	КомментарийИнженера = КомментарийИнженера + "Оборудование: " + ОборудованиеИнженерТекст;
		//КонецЕсли;
		
		// Исполнители		
		Если ЗначениеЗаполнено(ИсполнителиТекст) Тогда
			Если ЗначениеЗаполнено(КомментарийИнженера) Тогда
				КомментарийИнженера = КомментарийИнженера + Символы.ПС;
			КонецЕсли;
			КомментарийИнженера = КомментарийИнженера + ?(КоличествоИсполнителей = 1, "Исполнитель: ", "Исполнители:" + Символы.ПС) + ИсполнителиТекст;
		КонецЕсли;
		
		
		Подвал.Параметры.КомментарийИнженера = КомментарийИнженера;	
		//-- смарт:ММ 01.03.2020
		
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

//++ #Б-1474 смарт: Фролов 05.12.2024 //Доработка функционала Маркетингового мероприятия
Функция смартПечатьРезервОборудования(ТабДок, ОбъектСсылка) Экспорт
	
    Макет = Документы.МаркетинговыеМероприятияДокумент.ПолучитьМакет("смартРезервОборудования");
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Оборудование КАК Оборудование
	|ПОМЕСТИТЬ ОборудованиеДокумента
	|ИЗ
	|	Документ.МаркетинговыеМероприятияДокумент.табОборудованиеДляДемонстрации
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ссылка.Дата КАК ДатаСобытия,
	|	Ссылка КАК Документ,
	|	Ссылка.ТипМероприятия КАК ТипМероприятия,
	|	Ссылка.ВремяНачалаПлан КАК ВремяНачалаПлан,
	|	Оборудование КАК Оборудование,
	|	ВЫБОР
	|		КОГДА НЕ Ссылка.смартДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Ссылка.смартДатаНачала
	|		КОГДА НЕ Ссылка.ДатаНачалаПлан = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Ссылка.ДатаНачалаПлан
	|		ИНАЧЕ Ссылка.ЖелаемаяДатаИзготовления
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА НЕ Ссылка.смартДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Ссылка.смартДатаОкончания
	|		КОГДА НЕ Ссылка.ДатаНачалаПлан = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА КОНЕЦПЕРИОДА(Ссылка.ДатаНачалаПлан, ДЕНЬ)
	|		ИНАЧЕ КОНЕЦПЕРИОДА(Ссылка.ЖелаемаяДатаИзготовления, ДЕНЬ)
	|	КОНЕЦ КАК ДатаОкончания
	|ИЗ
	|	Документ.МаркетинговыеМероприятияДокумент.табОборудованиеДляДемонстрации
	|ГДЕ
	|	Оборудование В
	|			(ВЫБРАТЬ
	|				Оборудование ИЗ ОборудованиеДокумента)
	|	И Ссылка.Проведен
	|	И НЕ Ссылка.ЗаявкаЗакрыта
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСобытия");
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

	ТабДок.Очистить();
	
	ОбластьШапка.Параметры.ДатаФормирования = ТекущаяДата();
	ТабДок.Вывести(ОбластьШапка);
	
	НомПП = 1;
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ОбластьСтрока.Параметры.ВремяНачала = ?(ЗначениеЗаполнено(Выборка.ВремяНачалаПлан), Формат(Выборка.ВремяНачалаПлан, "ДЛФ=В"),
			Формат(Выборка.ДатаНачала, "ДЛФ=В"));
		ОбластьСтрока.Параметры.ВремяОкочания = ?(НачалоДня(Выборка.ДатаОкончания) = Выборка.ДатаОкончания, 
			Формат(КонецДня(Выборка.ДатаОкончания), "ДЛФ=В"), Формат(Выборка.ДатаОкончания, "ДЛФ=В"));
		ОбластьСтрока.Параметры.НомПП = НомПП;
		ТабДок.Вывести(ОбластьСтрока);
		
		НомПП = НомПП + 1;
		
	КонецЦикла;	
	
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
	
КонецФункции //-- #Б-1474 смарт: Фролов 05.12.2024

#КонецОбласти

//++ смарт:Балашов #1358 22.05.2023
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры //-- смарт:Балашов #1358 22.05.2023

Процедура ОбновитьОценкуДемонстрации(ОбъектСсылка) Экспорт
	
	Если ОбъектСсылка.Оценка = 1 Тогда
		ОбъектСсылка.Оценка1 = Истина;
		ОбъектСсылка.Оценка2 = Ложь;
		ОбъектСсылка.Оценка3 = Ложь;
		ОбъектСсылка.Оценка4 = Ложь;
		ОбъектСсылка.Оценка5 = Ложь;
	ИначеЕсли ОбъектСсылка.Оценка = 2 Тогда
		ОбъектСсылка.Оценка1 = Ложь;
		ОбъектСсылка.Оценка2 = Истина;
		ОбъектСсылка.Оценка3 = Ложь;
		ОбъектСсылка.Оценка4 = Ложь;
		ОбъектСсылка.Оценка5 = Ложь;	
	ИначеЕсли ОбъектСсылка.Оценка = 3 Тогда
		ОбъектСсылка.Оценка1 = Ложь;
		ОбъектСсылка.Оценка2 = Ложь;
		ОбъектСсылка.Оценка3 = Истина;
		ОбъектСсылка.Оценка4 = Ложь;
		ОбъектСсылка.Оценка5 = Ложь;
	ИначеЕсли ОбъектСсылка.Оценка = 4 Тогда
		ОбъектСсылка.Оценка1 = Ложь;
		ОбъектСсылка.Оценка2 = Ложь;
		ОбъектСсылка.Оценка3 = Ложь;
		ОбъектСсылка.Оценка4 = Истина;
		ОбъектСсылка.Оценка5 = Ложь;
	ИначеЕсли ОбъектСсылка.Оценка = 5 Тогда
		ОбъектСсылка.Оценка1 = Ложь;
		ОбъектСсылка.Оценка2 = Ложь;
		ОбъектСсылка.Оценка3 = Ложь;
		ОбъектСсылка.Оценка4 = Ложь;
		ОбъектСсылка.Оценка5 = Истина;
	Иначе
		ОбъектСсылка.Оценка1 = Ложь;
		ОбъектСсылка.Оценка2 = Ложь;
		ОбъектСсылка.Оценка3 = Ложь;
		ОбъектСсылка.Оценка4 = Ложь;
		ОбъектСсылка.Оценка5 = Ложь;
	КонецЕсли;
	
	Если ОбъектСсылка.Оценка > 5 Тогда
		ОбъектСсылка.Оценка = 0;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьДоступностьДатыМероприятия(Знач ОбъектСсылка)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Результат=Новый Структура("ДатаСвободна,Ошибки",Истина,Новый Массив);
	
	ПроверяемаяДата=?(ЗначениеЗаполнено(ОбъектСсылка.ДатаНачалаФакт),ОбъектСсылка.ДатаНачалаФакт,ОбъектСсылка.ДатаНачалаПлан);
	Если Не ЗначениеЗаполнено(ПроверяемаяДата) Тогда Возврат Результат; КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("МассивОборудования",ОбъектСсылка.табОборудованиеДляДемонстрации.Выгрузить().ВыгрузитьКолонку("Оборудование"));
	Запрос.УстановитьПараметр("ВыбираемаяДатаМероприятия",ПроверяемаяДата);
	Запрос.УстановитьПараметр("Ссылка",ОбъектСсылка.Ссылка);
	
	Запрос.Текст="ВЫБРАТЬ
	|демоДемонстрацияОборудования.Регистратор КАК Мероприятие,
	|демоДемонстрацияОборудования.Номенклатура КАК Оборудование,
	|ВЫБОР
	|	КОГДА демоДемонстрацияОборудования.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1)
	|		ТОГДА демоДемонстрацияОборудования.ДатаНачалаПлан
	|	ИНАЧЕ демоДемонстрацияОборудования.ДатаНачалаФакт
	|КОНЕЦ КАК ДатаМероприятия
	|ИЗ
	|РегистрНакопления.демоДемонстрацияОборудования КАК демоДемонстрацияОборудования
	|ГДЕ
	|демоДемонстрацияОборудования.Регистратор ССЫЛКА Документ.МаркетинговыеМероприятияДокумент
	|И демоДемонстрацияОборудования.Номенклатура В(&МассивОборудования)
	|И (демоДемонстрацияОборудования.ДатаНачалаФакт = &ВыбираемаяДатаМероприятия
	|		ИЛИ демоДемонстрацияОборудования.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1)
	|			И демоДемонстрацияОборудования.ДатаНачалаПлан = &ВыбираемаяДатаМероприятия)
	|";
	Если ЗначениеЗаполнено(ОбъектСсылка.Ссылка) Тогда 
		Запрос.Текст=Запрос.Текст+"И НЕ демоДемонстрацияОборудования.Регистратор = &Ссылка";
	КонецЕсли;	
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Результат.ДатаСвободна=Ложь;
		Результат.Ошибки.Добавить(Новый Структура("Мероприятие,Оборудование,ДатаМероприятия",Рез.Мероприятие,Рез.Оборудование,Рез.ДатаМероприятия));
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
КонецФункции	

#Область КомандныйИнтерфейс

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ЗаказНаВнутреннееПотребление.ДобавитьКомандуСоздатьНаОснованииЗаказа(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания документа "Заказ на внутреннее потребление".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.МаркетинговыеМероприятияДокумент) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.МаркетинговыеМероприятияДокумент.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.МаркетинговыеМероприятияДокумент);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьЗаказыНаВнутреннееПотребление";
	
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//rnp 10052021 закомментировано, релиз 13.47 
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	ИнтеграцияИСПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
	КомандаОтчет = Отчеты.СостояниеВыполненияДокументов.ДобавитьКомандуСостояниеВыполненияВнутреннихРаспоряжений(КомандыОтчетов);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.Порядок = 1;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 
#КонецОбласти 
#КонецЕсли
